Tekla Open API Reference for Tekla Structures 2025
LinkFrameAttributes Class
 The LinkFrameAttributes class contains the attributes for controlling the appearance of a link frame.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.LinkFrameAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LinkFrameAttributes : GenericAttributesBase,
	IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IIsEqual
<SerializableAttribute>
Public NotInheritable Class LinkFrameAttributes
	Inherits GenericAttributesBase
	Implements IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IIsEqual
The LinkFrameAttributes type exposes the following members.
Constructors
Name | Description
LinkFrameAttributes
Initializes a new instance of the LinkFrameAttributes class
Top
Properties
Name | Description
Color |  Obsolete.
Line
 Gets or sets the line type.
LineType |  Obsolete.
Top
Methods
Name | Description
GetAxisAlignedBoundingBox
 Gets the bounding box of the frame in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Gets the bounding box of the frame in the local coordinate system.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace